In [9]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# convert to datetime
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [ ]:
df[pd.notna(df['salary_year_avg'])]['salary_year_avg']

In [37]:
df_salary = df[pd.notna(df['salary_year_avg'])].copy()

In [21]:
df_salary.sample(2)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills,salary_year_inflated
304216,Senior Data Engineer,Sr. Data Engineer - ASM Analytics,"Bengaluru, Karnataka, India",via Ai-Jobs.net,Full-time,False,India,2023-04-12 17:30:13,False,False,India,year,147500.0,NaN,Visa,"[sql, python, javascript, css, sql server, had...","{'analyst_tools': ['excel', 'tableau'], 'datab...",151925.0
578202,Data Engineer,"Data Engineer, BPE","Menlo Park, CA",via Ladders,Full-time,False,"Texas, United States",2023-06-20 09:06:35,False,True,United States,year,175000.0,NaN,Meta,"[sql, python]","{'programming': ['sql', 'python']}",180250.0

In [36]:
def projected_salary(salary):
  return salary * 1.03

df_salary['salary_year_inflated'] = df_salary['salary_year_avg'].apply(projected_salary)

df_salary[['salary_year_avg', 'salary_year_inflated']].sample(3, random_state=1)

        salary_year_avg  salary_year_inflated
567253         114500.0              117935.0
641396          86450.0               89043.5
670736         175000.0              180250.0

In [33]:
def projected_salary(row):
  if "Senior" in row['job_title_short']:
    return row['salary_year_avg'] * 1.05
  else:
    return row['salary_year_avg'] * 1.03

df_salary['salary_year_inflated'] = df_salary.apply(projected_salary, axis=1)

In [39]:
df_salary['salary_year_inflated'] = df_salary.apply(lambda row: row['salary_year_avg'] * 1.05 if "Senior" in row['job_title_short'] else row['salary_year_avg'] * 1.03, axis=1)

In [40]:
df_salary[['job_title_short', 'salary_year_avg', 'salary_year_inflated']].sample(3, random_state=1)

              job_title_short  salary_year_avg  salary_year_inflated
567253         Data Scientist         114500.0              117935.0
641396           Data Analyst          86450.0               89043.5
670736  Senior Data Scientist         175000.0              183750.0

In [ ]:
# df_salary_2['projected_salary'] = df['salary_year_avg'].apply(lambda salary: salary * 1.03)
# df_salary_2[['salary_year_avg', 'projected_salary']].head()

In [ ]:
# df_salary_3['projected_salary'] = df_salary_3['salary_year_avg'] * 1.03
# df_salary_3[['salary_year_avg', 'projected_salary']].head()

In [ ]:
df['job_skills'][1]

In [ ]:
# list(df['job_skills'][1])

import ast
type(ast.literal_eval(df['job_skills'][1]))

In [ ]:
def clean_list(skill_list):
  if pd.notna(skill_list):
    return ast.literal_eval(skill_list)

df['job_skills'] = df['job_skills'].apply(clean_list)

In [12]:
df['job_skills'] = df['job_skills'].apply(lambda skill_list: ast.literal_eval(skill_list) if pd.notna(skill_list) else skill_list)

In [13]:
# df[pd.isna(df['job_skills'])] # check if there are missing values
df['job_skills'][1]

['r', 'python', 'sql', 'nosql', 'power bi', 'tableau']